Repository: censurfridns/blog.censurfridns.dk
Catalog: src/blog/locale/*/LC_MESSAGES/django.po
Languages: da

source: UncensoredDNS Blog Posts
da: CensurfriDNS blogindlæg

source: Blog posts and system information from UncensoredDNS
da: Blogindlæg og driftsinformation fra CensurfriDNS

source: Invalid language
da: Ugyldigt sprog

source: English
da: Engelsk

source: Danish
da: Dansk

source: About this service
da: Om denne tjeneste

source: UncensoredDNS was started in November 2009. At the time I was working at an ISP where one of my (reluctant) responsibilities was to administer the censored DNS servers that all Danish ISPs have to run for their customers. I have never been a fan of the Danish DNS censorship system, and working with it first hand didn't exactly help.
da: CensurfriDNS blev startet i november 2009. På det tidspunkt arbejdede jeg hos en ISP hvor et af mine (modvillige) ansvarsområder var at administrere de censurerede DNS servere som alle danske internetudbydere skal køre for deres kunder. Jeg har aldrig været en stor fan af det danske DNS censur system, og det hjalp bestemt ikke at arbejde med det.

source: The 2009 DNS ecosystem was different from today. Google, Cloudflare, and Quad9 DNS services didn't exist yet. Friends and family were asking for a recommendation for an alternative to the censored ISP DNS servers and I didn't have a good answer for them.
da: I 2009 var DNS økosystemet på internettet meget anderledes fra i dag. Googles, Cloudflares og Quad9s DNS tjenester eksisterede ikke endnu. Venner og familie spurgte efter anbefalinger til et alternativ til internetudbydernes censurerede DNS servere.

source: OpenDNS (now owned by Cisco) did exist in 2009, but back then they did <i>NXDOMAIN redirection</i>, an advertising trick where misspelled nonexistant domains are redirected to a search page with ads instead of returning an NXDOMAIN error. They've since stopped doing it, but it showed what kind of company it was. They also didn't have ipv6 or DNSSEC, both of which are mandatory on a modern DNS server, even back in 2009.
da: OpenDNS (som i dag er ejet af Cisco) fandtes i 2009, men dengang lavede de <i>NXDOMAIN redirection</i>, en lusket reklameteknik hvor domæner der ikke findes (f.eks. grundet en stavefejl) bliver viderestillet til en søgeside med reklamer istedet for at give en NXDOMAIN fejl. De er siden stoppet med at gøre det, men det viste ret tydeligt hvilket slags firma det var. De havde desuden hverken ipv6 eller DNSSEC, begge dele var selv i 2009 nødvendige dele af en moderne DNS server.

source: Even if Google, Cloudflare or Quad9 DNS had existed back then I still wouldn't have felt comfortable recommending them. While they do run stable, fast and largely uncensored services, I am not convinced that it is a good idea to hand over all your DNS lookups to Google (or any other major corporation). The internet would be much better off with a bunch of smaller community-run decentral services.
da: Selv hvis Google, Cloudflare eller Quad9 havde eksisteret dengang ville jeg stadig ikke have haft det godt med at anbefale dem. De kører stabile, hurtige og rimeligt ucensurerede DNS tjenester, men jeg er ikke overbevist om at det er en god ide at aflevere alle ens DNS opslag til Google (eller nogen andre store virksomheder). Internettet ville være langt bedre tjent med en masse mindre community-drevne decentrale tjenester.

source: I was fortunate to be in a position to do something about it, so in October 2009 I started UncensoredDNS with help from friends. After a while I also started giving talks about the service at various conferences, since people naturally have an easier time trusting a service if they know who is behind it. You can see some of my old talks online, for example from
da: Jeg var heldig at være i en position hvor jeg kunne gøre noget ved det, så i oktober 2009 startede jeg CensurfriDNS med hjælp fra venner. Efter noget tid begyndte jeg også at holde foredrag om projektet på diverse konferencer, da folk naturligt har lettere ved at stole på en tjeneste hvis de ved hvem der står bag. Du kan se nogen af mine gamle foredrag online, for eksempel fra

source: In 2014 I got an IP allocation from RIPE leading to the introduction of anycast.uncensoreddns.org - initially just with two locations. Anycasting one of the nodes meant much better redundancy and performance, and also allowed me to do maintaince without interrupting service.
da: I 2014 fik jeg en IP allokering fra RIPE som førte til introduktionen af anycast.censurfridns.dk - til at begynde med bare med to lokationer. At anycaste den ene node giver langt bedre redundans og performance, og samtidig giver det mig mere frihed til at lave maintenance uden at have nedetid.

source: Since mid 2017 it has been possible to do encrypted DNS lookups. DNS-over-TLS support (RFC7858) was added using nginx (proxying to bind tcp 53), and at the same time the TLS public keys were published in TLSA records and on the website, making it possible to pin the servers public keys.
da: Siden medio 2017 har det været muligt at lave krypterede DNS opslag. DNS-over-TLS (RFC7858) support blev tilføjet med nginx (som proxy til bind tcp port 53), og på samme tid blev de offentlige TLS nøgler publiceret i TLSA records og på dette website. Det gav mulighed for at pinne de offentlige nøgler.

source: In 2020 DNS-over-HTTPS (RFC8484) support was introduced using dnsdist, and at the same time DoT was switched from nginx to dnsdist, still using bind as a backend. The introduction of dnsdist means it will be possible in the future to switch to a different backend recursor, or use different recursors on different anycast nodes for added redundancy.
da: I 2020 blev DNS-over-HTTPS (RFC8484) support introduceret med dnsdist, og på samme tid blev DoT skiftet fra nginx til dnsdist, stadig med bind som backend. Introduktionen af dnsdist gør det muligt senere at skifte backend rekursiv software, eller at køre forskellige backends på forskellige anycast noder.

source: In October 2022 plaintext UDP/TCP port 53 DNS was switched off, 13 years after the inception of the service. Only the modern encrypted protocols DNS-over-TLS (RFC7858) and DNS-over-HTTPS (RFC8484) will be supported going forward.
da: I oktober 2022 blev klartekst UDP/TCP port 53 DNS opslag slået fra, 13 år efter tjenestens fødsel. Kun de moderne DNS-over-TLS og DNS-over-HTTPS protokoller vil være understøttet fremover.

source: UncensoredDNS Blog
da: CensurfriDNS Blog

source: uncensoreddns blog
da: censurfridns blog

source: UncensoredDNS
da: CensurfriDNS

source: DNS Servers
da: DNS Servere

source: About
da: Om

source: FAQ
da: OSS

source: Contact
da: Kontakt

source: uncensoreddns
da: censurfridns

source: Tags:
da: Kategorier:

source: Rants and service information
da: Brok og driftsinformation

source: You have a few options for getting in touch with me:
da: Der er forskellige muligheder for at komme i kontakt med mig:

source: DNS servers
da: DNS servere

source: Anycast from multiple locations - see the table below.
da: Anycastet fra flere locationer - se tabellen nedenfor.

source: Listens on port 853 for DoT and on port 443 for DoH.
da: Lytter på port 853 for DoT og på port 443 for DoH.

source: DNS-over-HTTPS URL is https://anycast.uncensoreddns.org/dns-query
da: DNS-over-HTTPS URL er https://anycast.censurfridns.dk/dns-query

source: This node is hosted at AS9167 in Copenhagen, Denmark.
da: Denne node sidder på AS9167 i København, Danmark.

source: DNS-over-HTTPS URL is https://unicast.uncensoreddns.org/dns-query
da: DNS-over-HTTPS URL er https://unicast.censurfridns.dk/dns-query

source: Server Details
da: Server detaljer

source: AS / Location
da: AS / Placering

source: TLS Public Key
da: TLS Offentlig Nøgle

source: Frequently Asked Questions
da: Ofte stillede spørgsmål

source: Why have you started UncensoredDNS? Why run uncensored DNS servers?
da: Hvorfor har du lavet CensurfriDNS? Hvorfor drive censur-fri DNS servere?

source: I am strongly against using DNS as a tool to filter content on the internet. Many people do not have the technical know-how to setup their own DNS server, so I created UncensoredDNS in 2009 as an uncensored alternative to the internet providers filtered DNS servers.
da: Jeg er kraftigt imod anvendelsen af DNS som et værktøj til at filtrere indhold på internettet. Mange har ikke den tekniske formåen til at sætte deres egen DNS server op, så jeg har lavet CensurfriDNS så der er et dansk censurfrit alternativ til internetudbydernes DNS servere.

source: Why not just use OpenDNS/Google DNS/Cloudflare/Quad9?
da: Hvorfor ikke bare bruge OpenDNS/Google DNS/Cloudflare/Quad9?

source: The internet should have more small decentral community-run non-profit services and fewer huge corporations running services with massive userbases. This is also true when picking email/IM/SoMe services.
da: Internettet burde bestå af flere små decentrale community-drevne non-profit tjenester og færre kæmpe virksomheder som driver tjenester med enorme brugerbaser. Det samme er sandt når man vælger email/IM/SoMe tjenester.

source: Do the UncensoredDNS DNS servers log any personal information?
da: Logger CensurfriDNS DNS serverne nogen private oplysninger?

source: Absolutely nothing is being logged, neither about the users nor the usage of this service. I do keep graphs of the total number of queries, but no personally identifiable information is saved. The data that is saved will never be sold or used for anything except capacity planning of the service.
da: Absolut intet bliver logget, hverken om brugerne eller om brugen af denne service. Jeg har grafer over samlet antal queries, men intet der kan tilbageføres til den enkelte bruger. De data der gemmes vil aldrig blive solgt videre, eller brugt til andet end kapacitetsplanlægning af servicen.

source: Where are the servers located?
da: Hvor står serverne?

source: See the details on the DNS Servers page. They are placed on fast uplinks in professional data centers. I am actively looking for places to host anycast nodes, especially outside of Denmark or even outside of Europe. Please contact me if you can help.
da: Se detaljerne på DNS Servere siden. De står på hurtige linier i professionelle datacentre. Jeg leder aktivt efter flere steder som kan hoste en anycast node. Særligt steder udenfor Danmark eller Europa har interesse. Kontakt mig endelig hvis du kan hjælpe.

source: Are the IP addresses likely to change?
da: Kommer IP adresserne til at skifte?

source: The DNS server IP addresses will never change if I can prevent it. The anycast server in particular is unlikely to ever change since the v4 and v6 IPs are from UncensoredDNS' own provider independent IP ranges.
da: IP adresserne kommer ikke til at skifte hvis jeg på nogen måde kan forhindre det. Især anycast serveren kommer sandsynligvis aldrig til at ændre IP da dens IPer er fra CensurfriDNS' egne provider independent IP ranges.

source: Who is behind this service?
da: Hvem er bag denne tjeneste?

source: My name is Thomas Steen Rasmussen. I operate this DNS service as an individual with my own money. If you have questions or comments please see the <a href="%(contacturl)s">contact page</a>.
da: Mit navn er Thomas Steen Rasmussen. Jeg driver denne DNS tjeneste som privatperson for mine egne penge. Hvis du har spørgsmål eller kommentarer kan du kigge på <a href="%(contacturl)s">kontakt</a> siden.

source: Have you ever been contacted by authorities or law enforcement about this service?
da: Er du nogensinde blevet kontaktet af myndighederne omkring denne tjeneste?

source: No, I have never been contacted by authorities or law enforcement regarding this service. This message will be updated if it happens.
da: Nej, jeg er aldrig blevet kontaktet af myndighederne omkring denne tjeneste. Denne besked bliver opdateret hvis det sker.

source: The following two RSS/Atom feeds contain all blogposts:
da: De følgende to RSS/Atom feeds indeholder alle blogindlæg:

source: Welcome to UncensoredDNS
da: Velkommen til CensurfriDNS

source: UncensoredDNS is the name of a DNS service which consists of two uncensored DNS servers. The servers are available for use by anyone, free of charge.
da: CensurfriDNS er navnet på en DNS tjeneste som består af to ucensurerede DNS servere. Serverne er frit tilgængelige og kan benyttes gratis af alle.

source: This service is run by Thomas Steen Rasmussen, born 1979. I am a system architect and developer in a Danish company, and I also teach and consult in my spare time. I run UncensoredDNS as a private individual, with my own money.
da: Denne tjeneste drives af Thomas Steen Rasmussen, født 1979. Jeg er system arkitekt og udvikler i en dansk virksomhed, og jeg underviser og klovnsulenter i min fritid. Jeg driver CensurfriDNS som privat-person med mine egne penge.

source: You can read more using the menu above, or if you just want the DNS server info can get it below.
da: Du kan læse mere ved hjælp af menuen i toppen, eller hvis du bare vil have DNS server info så kan du se det længere nede.

source: Anycast from multiple locations.
da: Anycastet fra flere locationer.

source: DNS-over-TLS anycast.uncensoreddns.org:853
da: DNS-over-TLS anycast.censurfridns.dk:853

source: DNS-over-HTTPS https://anycast.uncensoreddns.org/dns-query
da: DNS-over-HTTPS https://anycast.censurfridns.dk/dns-query

source: DNS-over-TLS unicast.uncensoreddns.org:853
da: DNS-over-TLS unicast.censurfridns.dk:853

source: DNS-over-HTTPS https://unicast.uncensoreddns.org/dns-query
da: DNS-over-HTTPS https://unicast.censurfridns.dk/dns-query

source: Follow <a href="https://twitter.com/censurfridns" class="roboto-light">@censurfridns</a> on twitter for updates and information on the project.
da: Følg <a href="https://twitter.com/censurfridns" class="roboto-light">@censurfridns</a> på twitter for nyheder og information om projektet.

source: Latest blogposts
da: Seneste blogindlæg

source: by
da: af

source: Blogposts tagged %(name)s
da: Blogindlæg i kategorien %(name)s

source: Tag not found
da: Kategori ikke fundet

source: dns-servers/
da: dns-servere/

source: contact/
da: kontakt/

source: faq/
da: oss/

source: about/
da: om/
